wingOnly/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    location system;
    object snappyHexMeshDict;
}

    castellatedMesh true;
    snap true;
    addLayers true;
    geometry
    {
        NASA_Tiltwing_6pax_Wing_BOT.stl
        {
            type triSurfaceMesh;
            name wing_bot;
        }
        NASA_Tiltwing_6pax_Wing_TOP.stl
        {
            type triSurfaceMesh;
            name wing_top;
        }
        NASA_Tiltwing_6pax_Wing_TIP.stl
        {
            type triSurfaceMesh;
            name wing_tip;
        }
        NASA_Tiltwing_6pax_Wing_TE.stl
        {
            type triSurfaceMesh;
            name wing_te;
        }

    }

    castellatedMeshControls
    {
        features
        (

            {
                file "NASA_Tiltwing_6pax_Wing_BOT.eMesh";
                level 11;
            }
            {
                file "NASA_Tiltwing_6pax_Wing_TOP.eMesh";
                level 11;
            }
            {
                file "NASA_Tiltwing_6pax_Wing_TIP.eMesh";
                level 12;
            }
            {
                file "NASA_Tiltwing_6pax_Wing_TE.eMesh";
                level 12;
            }

        );
        refinementSurfaces
        {
            wing_bot
            {
                level ( 9 9 );
            }  
            wing_top
            {
                level ( 9 9 );
            }  
            wing_tip
            {
                level ( 12 12 );
            }   
            wing_te
            {
                level ( 12 12 );
            }               
        }

        refinementRegions
        {

        }

        locationInMesh ( -5 1 1 );
        maxLocalCells 10000000;
        maxGlobalCells 200000000;
        minRefinementCells 0;
        nCellsBetweenLevels 3;
        resolveFeatureAngle 10;
        allowFreeStandingZoneFaces true;
        planarAngle 30;
        maxLoadUnbalance 0.10;
    }

    snapControls
    {
        nSolveIter 50;
        nSmoothPatch 3;
        tolerance 2.0;
        nRelaxIter 5;
        nFeatureSnapIter 10;
        implicitFeatureSnap false;
        explicitFeatureSnap true;
        multiRegionFeatureSnap true;
    }

    addLayersControls
    {
        layers
        {
            "wing_bot"
            {nSurfaceLayers 4;}
	        "wing_top"
	        {nSurfaceLayers 4;}
            "wing_tip"
            {nSurfaceLayers 4;}
            "wing_te"
            {nSurfaceLayers 4;} 
        }

        relativeSizes true;
        expansionRatio 1.3;
        finalLayerThickness 0.4;
        minThickness 0.001;
        nGrow 0;
        featureAngle 180;
        slipFeatureAngle 80;
        nRelaxIter 5;
        nSmoothSurfaceNormals 1;
        nSmoothNormals 3;
        nSmoothThickness 10;
        maxFaceThicknessRatio 0.5;
        maxThicknessToMedialRatio 0.3;
        minMedialAxisAngle 90;
        nBufferCellsNoExtrude 0;
        nLayerIter 50;
        nRelaxedIter 20;
        writeVTK false;
        noErrors false;
        layerRecovery 1;
        growZoneLayers false;
        projectGrownUp 0.0;
    }

    meshQualityControls
    {
        maxNonOrtho 60;
        maxBoundarySkewness 4;
        maxInternalSkewness 4;
        maxConcave 80;
        minFlatness 0.5;
        minVol 1.00E-13;
        minTetQuality 1e-30;
        minArea 0;
        minTwist 0.03;
        minDeterminant 0.01;
        minFaceWeight 0.03;
        minVolRatio 0.01;
        minTriangleTwist -1;
        nSmoothScale 4;
        errorReduction 0.75;
        relaxed {maxNonOrtho 65; minTetQuality -1e30; }
    }

    debug 0;
    mergeTolerance 1E-6;
    autoBlockMesh false;
