wingOnly/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

NASA_Tiltwing_6pax_Wing_BOT.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0  : selects no edges
        // - 180: selects all edges
        includedAngle   150;
    }

    // Write options
    writeFeatureEdgeMesh    yes;
    // Write features to obj format for postprocessing
    writeObj                yes;
}

NASA_Tiltwing_6pax_Wing_TOP.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0  : selects no edges
        // - 180: selects all edges
        includedAngle   150;
    }

    // Write options
    writeFeatureEdgeMesh    yes;
    // Write features to obj format for postprocessing
    writeObj                yes;
}

NASA_Tiltwing_6pax_Wing_TIP.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0  : selects no edges
        // - 180: selects all edges
        includedAngle   150;
    }

    // Write options
    writeFeatureEdgeMesh    yes;
    // Write features to obj format for postprocessing
    writeObj                yes;
}

NASA_Tiltwing_6pax_Wing_TE.stl
{
    extractionMethod    extractFromSurface;

    extractFromSurfaceCoeffs
    {
        // Mark edges whose adjacent surface normals are at an angle less
        // than includedAngle as features
        // - 0  : selects no edges
        // - 180: selects all edges
        includedAngle   150;
    }

    // Write options
    writeFeatureEdgeMesh    yes;
    // Write features to obj format for postprocessing
    writeObj                yes;
}


// ************************************************************************* //
